sparkfun/Qduino_Mini_SFE/Software/1.0.0/boards.txt
# Qtechknow Qduino Mini Board Configuration
#
# For more information see:
# * https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# * https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

qduinomini.name=Qduino Mini
qduinomini.build.board=AVR_QDUINOMINI
qduinomini.build.vid.0=0x1B4F
qduinomini.build.pid.0=0x514D
qduinomini.build.vid.1=0x1B4F
qduinomini.build.pid.1=0x516D

qduinomini.upload.tool=arduino:avrdude
qduinomini.upload.protocol=avr109
qduinomini.upload.maximum_size=28672
qduinomini.upload.speed=57600
qduinomini.upload.disable_flushing=true
qduinomini.upload.use_1200bps_touch=true
qduinomini.upload.wait_for_upload_port=true

qduinomini.bootloader.low_fuses=0xFF
qduinomini.bootloader.high_fuses=0xD8
qduinomini.bootloader.extended_fuses=0xFC
qduinomini.bootloader.file=caterina/Caterina-qduinomini.hex
qduinomini.bootloader.unlock_bits=0x3F
qduinomini.bootloader.lock_bits=0x2F
qduinomini.bootloader.tool=arduino:avrdude

qduinomini.build.mcu=atmega32u4
qduinomini.build.f_cpu=8000000L
qduinomini.build.vid=0x1B4F
qduinomini.build.pid=0x9204
qduinomini.build.usb_product="Qtechknow Qduino Mini"
qduinomini.build.core=arduino:arduino
qduinomini.build.variant=qduinomini
qduinomini.build.extra_flags={build.usb_flags}
qduinomini.build.usb_manufacturer="SparkFun Electronics"
